WynneNero/Project_LoRa/AurduinoMulticoreUser/aurix/variants/tc275/Variant.h


/*
 * This Header File specifies any variables/defines/data etc that is
 * specific to the chip. Anything that is general to the Arduino
 * framework should be put in the respective module or in the
 * global Arduino.h header file.
 *
 *
 */

#ifndef _VARIANT_H
#define _VARIANT_H

// Definition for Marlin 3D printer driver
#define _AURIX_SHIELDBUDDY_TC275_
#define constepxr const   /* constexpr is c++11 */
#define cli()  __disable()
#define sei()  __enable()

// Simulate the C11++ static_assert
#define ASSERT_CONCAT_(a, b) a##b
#define ASSERT_CONCAT(a, b) ASSERT_CONCAT_(a, b)
#define static_assert(e,m) ;enum { ASSERT_CONCAT(assert_line_, __LINE__) = 1/(int)(!!(e)) }

#include "Arduino.h"
#include "Bootloader.h"
#include "TIMdriver.h"
#include "GeneralTimers.h"
#include "Binary.h"
#include "SbCheck.h"




#ifdef __cplusplus


#endif

#ifdef __cplusplus
extern "C"{
#endif



#undef HIGH
#undef LOW
#include "system_tc2x.h"
#include "Port/Io/IfxPort_Io.h"
#include "Std/IfxScuWdt.h"
#include "IfxStm_reg.h"

#if defined(__DCC__)
#include "IfxCpu_IntrinsicsDcc.h"

#elif defined(__GNUC__)
#include "IfxCpu_IntrinsicsGnuc.h"

#elif defined(__TASKING__)
#include "IfxCpu_IntrinsicsTasking.h"
#endif

#include <Asclin/Asc/IfxAsclin_Asc.h>
#include "Interrupts.h"
#include "Vadc.h"
#include "Ifx_CircularBuffer.h"
#include "IfxGtm_reg.h"
#include "timetick.h"
#include "Test_Time.h"
#include "analogOut.h"
#include "IfxScuCcu.h"
#include "IfxStm.h"

/* Multicore location macros */
#include "IfxMemMap.h"

/* Make iLLD GTM functions available */
#include <GTM/Tom/PwmHL/IfxGtm_Tom_PwmHL.h>
#include <GTM/Tom/Timer/IfxGtm_Tom_Timer.h>
#include <GTM/ATom/PwmHL/IfxGtm_ATom_PwmHL.h>
#include <GTM/ATom/Timer/IfxGtm_ATom_Timer.h>
#include <GTM/Trig/IfxGtm_Trig.h>
#include <GTM/std/IfxGtm_Atom.h>
#include <GTM/std/IfxGtm_CMU.h>
#include <GTM/std/IfxGtm_Tbu.h>
#include <GTM/std/IfxGtm_Tom.h>
#include <GTM/std/IfxGtm.h>

#include <Ccu6/PwmBc/IfxCcu6_PwmBc.h>

#include <IfxGpt12_reg.h>

/* Make iLLD MultiCAN functions available */
#include <Multican/Can/IfxMultiCan_can.h>
#include <Multican/Std/IfxMultiCan.h>

/* Make iLLD VADC functions available */
#include <Vadc/Adc/IfxVadc_Adc.h>
#include <Vadc/Std/IfxVadc.h>

/* Make iLLD VADC functions available */
#include <Dsadc/Dsadc/IfxDsadc_Dsadc.h>
#include <Dsadc/Std/IfxDsadc.h>

#include <IfxSrc_reg.h>

#include "Multican.h"

#if defined(__GNUC__)
#include "cint.h"
#endif

#include "tc275_pom.h"

#include <Scu/Std/IfxScuEru.h>
#include <_PinMap/IfxScu_PinMap.h>
#include "PinInterruptInit.h"

/* For WString.cpp */
#include "stdlib.h"
#include "itoa.h"
#include "dtostrf.h"


#include "EEPROM_TC275.h"

#include  "TriLib.h"

#include "vt100.h"

#include "stdio.h"
#include "stdarg.h"



/* For compatibility with older shield libraries */
#define ARDUINO 10600

#define _BV(a) (1<<a)

/* EEPROM */
#define E2START 0xAF000000ul
#define E2END  (0xAF060000ul-1ul)/* EEPROM (DFLASH) is available, last cell address */

/* TC275 clock */
#define F_CPU  200000000ul

#define HIGH 1
#define LOW 0

#define NoOfAURduinoVirtualPins		3U	// Used for additional SPI chip selects
#define ICP_P201_Pins				3U	// P201 SPI connector
#define NoOfAURduinoPins			58U + NoOfAURduinoVirtualPins + ICP_P201_Pins
#define NoOfAlternateAURduinoPins	4U

extern IfxPort_Pin const AURduinoPins[NoOfAURduinoPins];
extern IfxPort_Pin const AURduinoPinsAlternate[NoOfAlternateAURduinoPins];

void __libc_init_array(void);
void init( void );
void Reset_TC275(void);

/*----------------------------------------------------------------------------
 *        Pins
 *----------------------------------------------------------------------------*/

// Number of pins defined in PinDescription array
#define PINS_COUNT           12 // (79u)
#define NUM_DIGITAL_PINS     (56u)
#define NUM_ANALOG_INPUTS    (12u)

// These need adapting to Aurix
#define digitalPinToPort(P)        ((uint32)AURduinoPins[P].port)  		// ( g_APinDescription[P].pPort )
#define digitalPinToBitMask(P)     (1 << ((uint32_t)AURduinoPins[P].pinIndex))
#define digitalPinToBitMaskIOCR(P) (uint32_t)(8*(0x03u & (uint32_t)AURduinoPins[P].pinIndex))  	// ( g_APinDescription[P].ulPin )
//#define analogInPinToBit(P)        ( )
#define portOutputRegister(port)   (uint32*)&((Ifx_P*)port)->OUT.U;     // (Ifx_P_OUT*)&((Ifx_P*)port)->OUT.U//( &(port->PIO_ODSR) )   MODULE_P33.OUT.U = 1; Ifx_P
#define portInputRegister(port)    (uint32*)&((Ifx_P*)port)->IN.U;     // (Ifx_P_IN*)&((Ifx_P*)port)->IN.U //( &(port->PIO_PDSR) )
/* Return the address of the IOCRx required for this pin */
IFX_INLINE uint32 *portModeRegister(Ifx_P *port, uint32 _Pin)
{
	volatile Ifx_P_IOCR0 *iocr      = &(port->IOCR0);
	uint8                 iocrIndex = ((uint32_t)AURduinoPins[_Pin].pinIndex / 4);

	return((uint32 *)&iocr[iocrIndex].U);
}


#define digitalPinHasPWM(P)        ( g_APinDescription[P].ulPWMChannel != NOT_ON_PWM || g_APinDescription[P].ulTCChannel != NOT_ON_TIMER )

// Interrupts
#define digitalPinToInterrupt(p)  ((p) < NUM_DIGITAL_PINS ? (p) : -1)

// LEDs
#define PIN_LED_13           (13u)
#define PIN_LED_RXL          (72u)
#define PIN_LED_TXL          (73u)
#define PIN_LED              PIN_LED_13
#define PIN_LED2             PIN_LED_RXL
#define PIN_LED3             PIN_LED_TXL
#define LED_BUILTIN          13

/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 1

#define SPI_INTERFACE        SPI0
#define SPI_INTERFACE_ID     ID_SPI0
#define SPI_CHANNELS_NUM 4
#define PIN_SPI_SS0          (77u)
#define PIN_SPI_SS1          (87u)
#define PIN_SPI_SS2          (86u)
#define PIN_SPI_SS3          (78u)
#define PIN_SPI_MOSI         (75u)
#define PIN_SPI_MISO         (74u)
#define PIN_SPI_SCK          (76u)
#define BOARD_SPI_SS0        (10u)   /* Pin10 is default CS on SPI Ch0: MISO = P201.1, MOSI = P201.4 SCK = P201.3           */
#define BOARD_SPI_SS0_S1	 (58) //(210u)  /* Really pin 10 but this means use it with SPI Ch 1: MISO = p12, MOSI = p11 SCK = p13 */
#define BOARD_SOFT_SPI_SS0	 (59) //(211u)  /* Bit bashed SPI only p10 chip select. MISO = p50, MOSI = p51 SCK = p52   */
#define BOARD_SOFT_SPI_SS2	 (60)  //(153u)  /* Bit bashed SPI only p53 chip select. MISO = p50, MOSI = p51 SCK = p52   */
#define BOARD_SPI_SS1        (4u)	 /* Used for SD Cards on SPI Ch0: MISO = P201.1, MOSI = P201.4 SCK = P201.3 */
#define BOARD_SPI_SS2        (53u)   /* Not used yet */
#define BOARD_SPI_SS3        PIN_SPI_SS3
#define BOARD_SPI_DEFAULT_SS BOARD_SPI_SS0 // BOARD_SPI_SS3


#define BOARD_PIN_TO_SPI_PIN(x) \
	(x==BOARD_SPI_SS0 ? PIN_SPI_SS0 : \
	(x==BOARD_SPI_SS1 ? PIN_SPI_SS1 : \
	(x==BOARD_SPI_SS2 ? PIN_SPI_SS2 : PIN_SPI_SS3 )))
#define BOARD_PIN_TO_SPI_CHANNEL(x) \
	(x==BOARD_SPI_SS0 ? 0 : \
	(x==BOARD_SPI_SS1 ? 1 : \
	(x==BOARD_SPI_SS2 ? 2 : 3)))

static const uint8_t SS   = BOARD_SPI_SS0;
static const uint8_t SS1  = BOARD_SPI_SS1;
static const uint8_t SS2  = BOARD_SPI_SS2;
static const uint8_t SS3  = BOARD_SPI_SS3;
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;



