WynneNero/Project_LoRa/AurduinoMulticoreUser/aurix/variants/tc275/Variant.h
/*
 * Wire Interfaces
 */
#define WIRE_INTERFACES_COUNT 2

#define PIN_WIRE_SDA         (20u)
#define PIN_WIRE_SCL         (21u)
#define WIRE_INTERFACE       TWI1
#define WIRE_INTERFACE_ID    ID_TWI1
#define WIRE_ISR_HANDLER     TWI1_Handler
#define WIRE_ISR_ID          TWI1_IRQn

#define PIN_WIRE1_SDA        (54u)
#define PIN_WIRE1_SCL        (55u)
#define WIRE1_INTERFACE      TWI0
#define WIRE1_INTERFACE_ID   ID_TWI0
#define WIRE1_ISR_HANDLER    TWI0_Handler
#define WIRE1_ISR_ID         TWI0_IRQn

/*
 * UART/USART Interfaces
 */
// Serial
#define PINS_UART            (81u)
// Serial1
#define PINS_USART0          (82u)
// Serial2
#define PINS_USART1          (83u)
// Serial3
#define PINS_USART3          (84u)

/* baud rate values at 100 MHz */
#define BAUD_9600				(48 * 1)
#define BAUD_19200				(48 * 2)
#define BAUD_38400				(48 * 4)
#define BAUD_57600				(48 * 6)
#define BAUD_115200				(48 * 12)

/* Aurix ASC definitions */
#define HTX_ASCLIN_FREQUENCY					((uint32) 100000000u)
#define HTX_ASCLIN_PRESCALER_HIGH_SPEED		    (1u)
#define HTX_ASCLIN_OVERSAMPLE_HIGH_SPEED		(4u)
#define HTX_ASCLIN_DENOMINATOR_HIGH_SPEED		(2000u)
#define HTX_ASCLIN_DIVISOR_HIGH_SPEED			(HTX_ASCLIN_FREQUENCY / ( (HTX_ASCLIN_PRESCALER_HIGH_SPEED + 1u) * (HTX_ASCLIN_OVERSAMPLE_HIGH_SPEED + 1u) ) )
#define HTX_ASCLIN_SAMPLE_POINT_HIGH_SPEED		(3u)		/* Sample-point = 1,2,3 */

#define HTX_ASCLIN_PRESCALER_LOW_SPEED			(9u)
#define HTX_ASCLIN_OVERSAMPLE_LOW_SPEED		    (15u)
#define HTX_ASCLIN_DENOMINATOR_LOW_SPEED		(3125u)
#define HTX_ASCLIN_DIVISOR_LOW_SPEED			(HTX_ASCLIN_FREQUENCY / ( (HTX_ASCLIN_PRESCALER_LOW_SPEED + 1u) * (HTX_ASCLIN_OVERSAMPLE_LOW_SPEED + 1u) ) )
#define HTX_ASCLIN_SAMPLE_POINT_LOW_SPEED		(9u)		/* Sample-point = 7,8,9 */

/* Defines for iLLD v1.0.0.11.0 */
#define IfxMultican_Status_noError IfxMultican_Status_newData

/*
 * USB Interfaces
 */
#define PINS_USB             (85u)

/*
 * Analog pins
 */
static const uint8_t A0  = 0;
static const uint8_t A1  = 1;
static const uint8_t A2  = 2;
static const uint8_t A3  = 3;
static const uint8_t A4  = 4;
static const uint8_t A5  = 5;
static const uint8_t A6  = 6;
static const uint8_t A7  = 7;
static const uint8_t A8  = 8;
static const uint8_t A9  = 9;
static const uint8_t A10 = 10;
static const uint8_t A11 = 11;
static const uint8_t DAC0 = 100;
static const uint8_t DAC1 = 101;
static const uint8_t DAC0_RF = 102;
static const uint8_t DAC1_RF = 103;
static const uint8_t CANRX = 68;
static const uint8_t CANTX = 69;
static const uint8_t SDA = 20;
static const uint8_t SCL = 21;
static const uint8_t SDA1 = 54;
static const uint8_t SCL1 = 55;
static const uint8_t SDA2 = 56;
static const uint8_t SCL2 = 57;

/* 54             |  PA16  | "A0"
*  55             |  PA24  | "A1"
*  56             |  PA23  | "A2"
*  57             |  PA22  | "A3"
*  58       TIOB2 |  PA6   | "A4"
*  69             |  PA4   | "A5"
*  60       TIOB1 |  PA3   | "A6"
*  61       TIOA1 |  PA2   | "A7"
*  62             |  PB17  | "A8"
*  63             |  PB18  | "A9"
*  64             |  PB19  | "A10"
*  65             |  PB20  | "A11"
*  66             |  PB15  | "DAC0"
*  67             |  PB16  | "DAC1"
*  68             |  PA1   | "CANRX"
*  69             |  PA0   | "CANTX"
*  70             |  PA17  | "SDA1"
*  71             |  PA18  | "SCL1"
*/
#define ADC_RESOLUTION		12

/*
 * Complementary CAN pins
 */
static const uint8_t CAN1RX = 88;
static const uint8_t CAN1TX = 89;

// CAN0
#define PINS_CAN0            (90u)
// CAN1
#define PINS_CAN1            (91u)

/* Fast IO pin definitions */
#define D0_OUT P15_OUT.B.P3
#define D1_OUT P15_OUT.B.P2
#define D2_OUT P02_OUT.B.P0
#define D3_OUT P02_OUT.B.P1
#define D4_OUT P10_OUT.B.P4
#define D5_OUT P02_OUT.B.P3
#define D6_OUT P02_OUT.B.P4
#define D7_OUT P02_OUT.B.P5
#define D8_OUT P02_OUT.B.P6
#define D9_OUT P02_OUT.B.P7
#define D10_OUT P10_OUT.B.P5
#define D11_OUT P10_OUT.B.P3
#define D12_OUT P10_OUT.B.P1
#define D13_OUT P10_OUT.B.P2
#define D14_OUT P15_OUT.B.P0
#define D15_OUT P15_OUT.B.P1

#define D16_OUT P33_OUT.B.P9
#define D17_OUT P33_OUT.B.P8
#define D18_OUT P20_OUT.B.P0
#define D19_OUT P20_OUT.B.P3
#define D20_OUT P20_OUT.B.P4
#define D21_OUT P20_OUT.B.P5
#define D22_OUT P14_OUT.B.P0
#define D23_OUT P14_OUT.B.P1
#define D24_OUT P15_OUT.B.P6

#define D25_OUT P00_OUT.B.P0
#define D26_OUT P00_OUT.B.P8
#define D27_OUT P00_OUT.B.P1
#define D28_OUT P00_OUT.B.P9
#define D29_OUT P00_OUT.B.P2
#define D30_OUT P00_OUT.B.P10
#define D31_OUT P00_OUT.B.P3
#define D32_OUT P00_OUT.B.P11
#define D33_OUT P00_OUT.B.P4
#define D34_OUT P00_OUT.B.P12
#define D35_OUT P00_OUT.B.P5
#define D36_OUT P33_OUT.B.P2
#define D37_OUT P00_OUT.B.P6
#define D38_OUT P33_OUT.B.P1
#define D39_OUT P00_OUT.B.P7

#define D40_OUT P33_OUT.B.P0
#define D41_OUT P11_OUT.B.P9
#define D42_OUT P11_OUT.B.P10
#define D43_OUT P11_OUT.B.P11
#define D44_OUT P33_OUT.B.P3

#define D45_OUT P11_OUT.B.P2
#define D46_OUT P11_OUT.B.P3
#define D47_OUT P11_OUT.B.P6
#define D48_OUT P21_OUT.B.P3
#define D49_OUT P21_OUT.B.P0

#define D50A_OUT P21_OUT.B.P2
#define D51A_OUT P13_OUT.B.P3
#define D52A_OUT P15_OUT.B.P8
#define D53A_OUT P20_OUT.B.P10

#define D50B_OUT P33_OUT.B.P4
#define D51B_OUT P02_OUT.B.P8
#define D52B_OUT P33_OUT.B.P5
#define D53B_OUT P11_OUT.B.P12

#define D54_OUT P13_OUT.B.P2
#define D55_OUT P13_OUT.B.P1

/* Analog pins with digital option */
#define A4A_OUT P10_OUT.B.P8
#define A5A_OUT P10_OUT.B.P7

#define A12A_OUT P20_OUT.B.P9
#define A12B_OUT P33_OUT.B.P10
#define A13A_OUT P33_OUT.B.P11
#define A14A_OUT P20_OUT.B.P7
#define A15A_OUT P20_OUT.B.P8


#define D0_IN P15_IN.B.P3
#define D1_IN P15_IN.B.P2
#define D2_IN P02_IN.B.P0
#define D3_IN P02_IN.B.P1
#define D4_IN P10_IN.B.P4
#define D5_IN P02_IN.B.P3
#define D6_IN P02_IN.B.P4
#define D7_IN P02_IN.B.P5
#define D8_IN P02_IN.B.P6
#define D9_IN P02_IN.B.P7
#define D10_IN P10_IN.B.P5
#define D11_IN P10_IN.B.P3
#define D12_IN P10_IN.B.P1
#define D13_IN P10_IN.B.P2
#define D14_IN P15_IN.B.P0
#define D15_IN P15_IN.B.P1

#define D16_IN P33_IN.B.P9
#define D17_IN P33_IN.B.P8
#define D18_IN P20_IN.B.P0
#define D19_IN P20_IN.B.P3
#define D20_IN P20_IN.B.P4
#define D21_IN P20_IN.B.P5
#define D22_IN P14_IN.B.P0
#define D23_IN P14_IN.B.P1
#define D24_IN P15_IN.B.P6

#define D25_IN P00_IN.B.P0
#define D26_IN P00_IN.B.P8
#define D27_IN P00_IN.B.P1
#define D28_IN P00_IN.B.P9
#define D29_IN P00_IN.B.P2
#define D30_IN P00_IN.B.P10
#define D31_IN P00_IN.B.P3
#define D32_IN P00_IN.B.P11
#define D33_IN P00_IN.B.P4
#define D34_IN P00_IN.B.P12
#define D35_IN P00_IN.B.P5
#define D36_IN P33_IN.B.P2
#define D37_IN P00_IN.B.P6
#define D38_IN P33_IN.B.P1
#define D39_IN P00_IN.B.P7

#define D40_IN P33_IN.B.P0
#define D41_IN P11_IN.B.P9
#define D42_IN P11_IN.B.P10
#define D43_IN P11_IN.B.P11
#define D44_IN P33_IN.B.P3

#define D45_IN P11_IN.B.P2
#define D46_IN P11_IN.B.P3
#define D47_IN P11_IN.B.P6
#define D48_IN P21_IN.B.P3
#define D49_IN P21_IN.B.P0

#define D50A_IN P21_IN.B.P2
#define D51A_IN P13_IN.B.P3
#define D52A_IN P15_IN.B.P8
#define D53A_IN P20_IN.B.P10

#define D50_IN P21_IN.B.P2
#define D51_IN P13_IN.B.P3
#define D52_IN P15_IN.B.P8
#define D53_IN P20_IN.B.P10

#define D50B_IN P33_IN.B.P4
#define D51B_IN P02_IN.B.P8
#define D52B_IN P33_IN.B.P5
#define D53B_IN P11_IN.B.P12

#define D54_IN P13_IN.B.P2
#define D55_IN P13_IN.B.P1


