WynneNero/Project_LoRa/AurduinoMulticoreUser/aurix/variants/tc275/Variant.h
#define IFX_INTPRIO_TIM_TPWM_ISR	8

#define ISR_PRIORITY_CCU6_PWMBC  	10

#define ISR_PRIORITY_SCUERU_0  		11

#define ISR_PRIORITY_TONE		  	12

//Priorities
#define IFX_INTPRIO_ASCLIN0_TX 		210
#define IFX_INTPRIO_ASCLIN0_RX 		211
#define IFX_INTPRIO_ASCLIN1_TX 		212
#define IFX_INTPRIO_ASCLIN1_RX 		213
#define IFX_INTPRIO_ASCLIN2_TX 		214
#define IFX_INTPRIO_ASCLIN2_RX 		215
#define IFX_INTPRIO_ASCLIN3_TX 		216
#define IFX_INTPRIO_ASCLIN3_RX 		217

#define IFX_INTPRIO_QSPI3_TX  		218
#define IFX_INTPRIO_QSPI3_RX  		219
#define IFX_INTPRIO_QSPI3_ER  		220
#define IFX_INTPRIO_QSPI2_TX  		221
#define IFX_INTPRIO_QSPI2_RX  		222
#define IFX_INTPRIO_QSPI2_ER  		223
#define IFX_INTPRIO_QSPI1_TX  		224
#define IFX_INTPRIO_QSPI1_RX  		225
#define IFX_INTPRIO_QSPI1_ER  		226

#define IFX_INTPRIO_GPT120_T6SPRN	228
#define IFX_INTPRIO_GPT120_T5SPRN	229 /* Must be higher */

#define IFX_INTPRIO_VADCGTM_TRIG	230 /* Only used when GTM triggers VADC */

#define IFX_INTPRIO_GENTIMER0		240
#define IFX_INTPRIO_GENTIMER1		241
#define IFX_INTPRIO_GENTIMER2		242
#define IFX_INTPRIO_GENTIMER3		243
#define IFX_INTPRIO_GENTIMER4		244
#define IFX_INTPRIO_GENTIMER5		245
#define IFX_INTPRIO_GENTIMER6		246
#define IFX_INTPRIO_GENTIMER7		247
#define IFX_INTPRIO_GENTIMER8		248
#define IFX_INTPRIO_GENTIMER9		249

#define IFX_INTPRIO_NEOPIXEL		250
#define IFX_INTPRIO_NEOPIXEL_C0		250
#define IFX_INTPRIO_NEOPIXEL_C1		251
#define IFX_INTPRIO_NEOPIXEL_C2		252

/* Aurix-specific functions */
/* Return the ID Of this core */
#define GetCpuCoreID()  (_mfcr(CPU_CORE_ID) & 0x07UL)

/* Control core startup */
typedef enum { CORE0_NOT_INITIALISED, CORE0_INITIALISED } Core0InitialisedType;
extern Core0InitialisedType volatile Core0Initialised;

#define ShieldBuddyVersion  ShieldBuddy_Version
#define ShieldBuddyDate  	ShieldBuddy_Date

/* Macros for controlling shared resources */
/* defines for Semaphore/s */
#define Htx_RESOURCE_BUSY (1U)
#define Htx_RESOURCE_FREE (0U)

#define E_NOT_OK 	1u
#define E_OK 		0u

/* Compare and if true, set to new value in a single instruction */
#define  Htx_CmpAndSwap(ResourceStatusPtr,Value,Compare)  \
        cmpswap_w(((unsigned int volatile*)(void*)ResourceStatusPtr), ((unsigned int)Value), ((unsigned int)Compare) )

extern uint32 Htx_LockResource(uint32 *ResourcePtr);
extern void  Htx_UnlockResource(uint32* ResourcePtr);
extern uint32 Htx_GetSpinLock(uint32* SpinLckPtr,uint32 Timeout);
extern void Htx_ReleaseSpinLock(uint32* SpinLckPtr);

/* Macros for creating interrupts in another core */
#define InterruptCore0() SRC_GPSR_GPSR0_SR0.B.SETR=1
#define InterruptCore1() SRC_GPSR_GPSR0_SR1.B.SETR=1
#define InterruptCore2() SRC_GPSR_GPSR0_SR2.B.SETR=1


extern void CreateInterrupt(uint8 TargetCoreID, uint16 Priority, void (*CoreXinthandler)(void));
extern void CreateCore0Interrupt(void (*CoreXinthandler)(void));
extern void CreateCore1Interrupt(void (*CoreXinthandler)(void));
extern void CreateCore2Interrupt(void (*CoreXinthandler)(void));

/* Get a snapshot of STM0 */
#define GetCurrentNanoSecs()  STM0_TIM0.U

#ifdef __cplusplus
}
#endif

#ifdef __cplusplus

#include "WCharacter.h"

#include "HardwareSerial.h"
#include "HardwareSerial0.h"
#include "HardwareSerial1.h"
#include "HardwareSerialRxTx.h"

/* Allow shield drivers like MIDI to use RX TX serial port on ShieldBuddy */
#define HardwareSerial SerialClassRxTx

extern SerialClass3 SerialASC;  /* Arduino FDTI USB-COM          */
extern SerialClass2 Serial1; 	/* RX1/TX1 Arduino J403 17/16	 */
extern SerialClass1 Serial0; 	/* RX0/TX0 Arduino J403 15/14	 */
extern SerialClassRxTx Serial; 	/* RX/TX Arduino J402 D0/D1	     */


extern void asclin0TxISR(int i);
extern void asclin0RxISR(int i);
extern void asclin0ErISR(int i);

extern void asclin1TxISR(int i);
extern void asclin1RxISR(int i);
extern void asclin1ErISR(int i);

extern uint32 volatile CpuClock;
extern uint32 volatile SysClock;
extern uint32 volatile StmClock;

// Check CSA free space
extern uint16 CheckFreeCSA_Size(void);

extern uint16 volatile Core0_CsaFreeSpace;
extern uint16 volatile Core1_CsaFreeSpace;
extern uint16 volatile Core2_CsaFreeSpace;

extern void printfASC(const char *format, ... );

#endif


#endif


